IDEA Open Model
ConnectionCheckRes Class
Compatible with IDEA StatiCa 20.1
 Results for connection in project
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionCheckRes
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[SerializableAttribute]
public class ConnectionCheckRes
<SerializableAttribute>
Public Class ConnectionCheckRes
The ConnectionCheckRes type exposes the following members.
Constructors
Name | Description
ConnectionCheckRes
Initializes a new instance of the ConnectionCheckRes class
Top
Properties
Name | Description
ConnectionID
 Guid of connection
CheckResAnchor
 List of check results for anchors
CheckResBolt
 List of check results for bolts
CheckResConcreteBlock
 List of check results for concrete blocks
CheckResPlate
 List of check results for plates
CheckResSummary
 List of CheckResSummary
CheckResWeld
 List of check results for welds
Messages
 Gets or sets the list of errors, that apears during validation and/or calculation.
Name
 Name of connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace